app/views/flowers/props.html.erb

SELECT  "flowers".* FROM "flowers" WHERE (colour='yellow' OR colour2='yellow' OR colour3='yellow') AND (prop1='bell' OR prop2='bell' OR prop3='bell')  ORDER BY "flowers"."id" ASC LIMIT 1
---
            <% label = "<span style='font-size:25px;'>"+category.titlecase+"</span>"%>
            <%flowers = Flower.where("colour='"+params[:colour].to_s+"' OR colour2='"+params[:colour].to_s+"' OR colour3='"+params[:colour].to_s+"'").where("prop1='"+category+"' OR prop2='"+category+"' OR prop3='"+category+"'")%>