app/views/flowers/show.html.erb

SELECT "flowers"."id" FROM "flowers" WHERE (colour='red' OR colour2='red' OR colour3='red') AND (petals='0' OR petals='10') AND (prop1='daisy' OR prop2='daisy' OR prop3='daisy')
---
        <% ids.each do |id| %>
          <%flower = Flower.find(id) %>