app/controllers/flowers_controller.rb

    def props
        flowers = Flower.where("colour='"+params[:colour].to_s+"' OR colour2='"+params[:colour].to_s+"' OR colour3='"+params[:colour].to_s+"'")
        @categories = flowers.pluck(:prop1)
        @categories << flowers.pluck(:prop2)
        @categories << flowers.pluck(:prop3)
---
SELECT  "flowers".* FROM "flowers" WHERE (colour='yellow' OR colour2='yellow' OR colour3='yellow') AND (prop1='bell' OR prop2='bell' OR prop3='bell')  ORDER BY "flowers"."id" ASC LIMIT 1
SELECT "flowers"."prop1" FROM "flowers" WHERE (colour='white' OR colour2='white' OR colour3='white')
SELECT "flowers"."prop2" FROM "flowers" WHERE (colour='white' OR colour2='white' OR colour3='white')
SELECT "flowers"."prop3" FROM "flowers" WHERE (colour='white' OR colour2='white' OR colour3='white')

    def show
        petals = 0
        params[:petals].blank? ? petals = 0 : petals = params[:petals]
        @flowers = Flower.where("colour='"+params[:colour].to_s+"' OR colour2='"+params[:colour].to_s+"' OR colour3='"+params[:colour].to_s+"'").where("petals='"+petals.to_s+"'").where("prop1='"+params[:prop].to_s+"' OR prop2='"+params[:prop].to_s+"' OR prop3='"+params[:prop].to_s+"'").pluck(:id)

        if @flowers.length > 1
---
SELECT "flowers"."id" FROM "flowers" WHERE (colour='orange' OR colour2='orange' OR colour3='orange') AND "flowers"."petals" IS NULL AND (prop1='aquatic' OR prop2='aquatic' OR prop3='aquatic')
SELECT "flowers".* FROM "flowers" WHERE (colour='white' OR colour2='white' OR colour3='white') AND "flowers"."petals" = ?  [["petals", 4]]